Repository: MateusMPires/Localization-Lab
Catalog: Localization-Lab/Localizable.xcstrings
Source language: pt_br
Languages: de, en

# adaptability_explanation
source: Alguns idiomas exigem mais espaço. O SwiftUI utiliza o componente ViewThatFits para quebrar o layout verticalmente caso a frase não caiba na tela.
de: Einige Sprachen benötigen mehr Platz. SwiftUI verwendet die ViewThatFits-Komponente, um das Layout vertikal umzubrechen, falls der Satz nicht auf den Bildschirm passt.
en: Some languages require more space. SwiftUI uses the ViewThatFits component to stack the layout vertically if the sentence doesn't fit on the screen.

# btn_close
source: Concluído
de: Fertig
en: Done

# btn_text
source: Explorar tradução
de: Übersetzung erkunden
en: Explore translation

# language_explanation
source: Escolha um idioma abaixo para ver a interface e os formatadores se adaptarem instantaneamente, sem precisar reiniciar o aplicativo.
de: Wählen Sie unten eine Sprache aus, um zu sehen, wie sich die Benutzeroberfläche und die Formatierer sofort anpassen, ohne die App neu starten zu müssen.
en: Choose a language below to see the interface and formatters adapt instantly, without needing to restart the app.

# language_section_title
source: Idioma do App
de: App-Sprache
en: App Language

# metric_balance
source: Saldo em Conta
de: Kontostand
en: Account Balance

# metric_date
source: Última Sincronização
de: Letzte Synchronisierung
en: Last Synchronization

# metric_temp
source: Clima Local
de: Lokales Wetter
en: Local Weather

# metrics_section_title
source: Tradução de Valores Numéricos
de: Übersetzung numerischer Werte
en: Translation of Numerical Values

# navigation_title
source: Ajustes
de: Einstellungen
en: Settings

# picker_label
source: Selecione o idioma
de: Sprache auswählen
en: Select language

# resilience_text
source: Espaço insuficiente.
de: Es ist nicht genügend Bildschirmplatz vorhanden, um diesen Inhalt horizontal anzuzeigen.
en: There is insufficient screen space to display this content horizontally.

# test_section_title
source: Teste de Adaptabilidade
de: Anpassungsfähigkeitstest
en: Adaptability Test
